{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "dl_model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_layer_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_layer", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 1440535, "output_dim": 64, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_lstm_first", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_first", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_lstm_second", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_second", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_first", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_first", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of89.bin", "group1-shard2of89.bin", "group1-shard3of89.bin", "group1-shard4of89.bin", "group1-shard5of89.bin", "group1-shard6of89.bin", "group1-shard7of89.bin", "group1-shard8of89.bin", "group1-shard9of89.bin", "group1-shard10of89.bin", "group1-shard11of89.bin", "group1-shard12of89.bin", "group1-shard13of89.bin", "group1-shard14of89.bin", "group1-shard15of89.bin", "group1-shard16of89.bin", "group1-shard17of89.bin", "group1-shard18of89.bin", "group1-shard19of89.bin", "group1-shard20of89.bin", "group1-shard21of89.bin", "group1-shard22of89.bin", "group1-shard23of89.bin", "group1-shard24of89.bin", "group1-shard25of89.bin", "group1-shard26of89.bin", "group1-shard27of89.bin", "group1-shard28of89.bin", "group1-shard29of89.bin", "group1-shard30of89.bin", "group1-shard31of89.bin", "group1-shard32of89.bin", "group1-shard33of89.bin", "group1-shard34of89.bin", "group1-shard35of89.bin", "group1-shard36of89.bin", "group1-shard37of89.bin", "group1-shard38of89.bin", "group1-shard39of89.bin", "group1-shard40of89.bin", "group1-shard41of89.bin", "group1-shard42of89.bin", "group1-shard43of89.bin", "group1-shard44of89.bin", "group1-shard45of89.bin", "group1-shard46of89.bin", "group1-shard47of89.bin", "group1-shard48of89.bin", "group1-shard49of89.bin", "group1-shard50of89.bin", "group1-shard51of89.bin", "group1-shard52of89.bin", "group1-shard53of89.bin", "group1-shard54of89.bin", "group1-shard55of89.bin", "group1-shard56of89.bin", "group1-shard57of89.bin", "group1-shard58of89.bin", "group1-shard59of89.bin", "group1-shard60of89.bin", "group1-shard61of89.bin", "group1-shard62of89.bin", "group1-shard63of89.bin", "group1-shard64of89.bin", "group1-shard65of89.bin", "group1-shard66of89.bin", "group1-shard67of89.bin", "group1-shard68of89.bin", "group1-shard69of89.bin", "group1-shard70of89.bin", "group1-shard71of89.bin", "group1-shard72of89.bin", "group1-shard73of89.bin", "group1-shard74of89.bin", "group1-shard75of89.bin", "group1-shard76of89.bin", "group1-shard77of89.bin", "group1-shard78of89.bin", "group1-shard79of89.bin", "group1-shard80of89.bin", "group1-shard81of89.bin", "group1-shard82of89.bin", "group1-shard83of89.bin", "group1-shard84of89.bin", "group1-shard85of89.bin", "group1-shard86of89.bin", "group1-shard87of89.bin", "group1-shard88of89.bin", "group1-shard89of89.bin"], "weights": [{"name": "bidirectional_lstm_first/forward_lstm_first/lstm_cell/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_lstm_first/forward_lstm_first/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_lstm_first/forward_lstm_first/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_lstm_first/backward_lstm_first/lstm_cell/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_lstm_first/backward_lstm_first/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_lstm_first/backward_lstm_first/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_lstm_second/forward_lstm_second/lstm_cell/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_lstm_second/forward_lstm_second/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_lstm_second/forward_lstm_second/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_lstm_second/backward_lstm_second/lstm_cell/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_lstm_second/backward_lstm_second/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_lstm_second/backward_lstm_second/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_first/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense_first/bias", "shape": [64], "dtype": "float32"}, {"name": "embedding_layer/embeddings", "shape": [1440535, 64], "dtype": "float32"}, {"name": "output_layer/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "output_layer/bias", "shape": [1], "dtype": "float32"}]}]}